CSI API ETABS v1
cDesignCompositeColumn.GetTargetDispl Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTargetDispl(
	ref int NumberItems,
	ref string[] LoadCase,
	ref string[] Point,
	ref double[] Displ,
	ref bool Active
)
Function GetTargetDispl (
	ByRef NumberItems As Integer,
	ByRef LoadCase As String(),
	ByRef Point As String(),
	ByRef Displ As Double(),
	ByRef Active As Boolean
) As Integer
Dim instance As cDesignCompositeColumn
Dim NumberItems As Integer
Dim LoadCase As String()
Dim Point As String()
Dim Displ As Double()
Dim Active As Boolean
Dim returnValue As Integer
returnValue = instance.GetTargetDispl(NumberItems,
	LoadCase, Point, Displ, Active)
int GetTargetDispl(
	int% NumberItems,
	array<String^>^% LoadCase,
	array<String^>^% Point,
	array<double>^% Displ,
	bool% Active
)
abstract GetTargetDispl :
        NumberItems : int byref *
        LoadCase : string[] byref *
        Point : string[] byref *
        Displ : float[] byref *
        Active : bool byref -> int
Parameters
NumberItems
Type: System.Int32
LoadCase
Type: System.String[]
Point
Type: System.String[]
Displ
Type: System.Double[]
Active
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cDesignCompositeColumn Interface
ETABSv1 Namespace